Repository: pypi-data/pypi-mirror-89
Catalog: packages/django-infopush/django_infopush-1.8.tar.gz/django_infopush-1.8/push/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Successfully activated %(count)d task.
ru: Успешно включено %(count)d задание.

source: Successfully deactivated %(count)d task.
ru: Успешно выключено %(count)d задание.

source: Deactivate selected tasks
ru: Выключить выбранные задания

source: Activate selected tasks
ru: Включить выбранные задания

source: already sent?
ru: уже разослали?

source: Push icon. Minimum %(min_w)dx%(min_h)d px, %(ratio_w)d:%(ratio_h)d aspect ratio. Optional (default icon will be used).
ru: Иконка пуша. Минимум %(min_w)dx%(min_h)d px, соотношение сторон %(ratio_w)d:%(ratio_h)d. Необязательно (будет иконка по умолчанию).

source: Big image for push in Chrome. Minimum %(min_w)dx%(min_h)d px, %(ratio_w)d:%(ratio_h)d aspect ratio. Optional (if so, there will be no big image).
ru: Большая картинка для пуша в Chrome. Минимум %(min_w)dx%(min_h)d px, соотношение сторон %(ratio_w)d:%(ratio_h)d. Необязательно (не будет).

source: File size can't exceed %(max_size)s. This image is %(img_size)s.
ru: Размер файла должен быть не больше %(max_size)s. Эта картинка %(img_size)s.

source: Image format doesn't match file extension. Please use another image.
ru: Формат картинки и расширение файла не совпадают, используйте другую картинку.

source: Image width must be minimum %(min_w)d px, this is %(w)d px.
ru: Ширина картинки должна быть минимум %(min_w)d px, у вас %(w)d px.

source: Image height must be minimum %(min_h)d px, this is %(h)d px.
ru: Высота картинки должна быть минимум %(min_h)d px, у вас %(h)d px.

source: Wrong aspect ratio, %(w_ratio)d:%(h_ratio)d needed.
ru: Неправильное соотношение сторон, нужно %(w_ratio)d:%(h_ratio)d.

source: You can't send pushes more than once per 6 hours. Please select another date and time.
ru: Нельзя отправлять уведомления чаще чем раз в 6 часов. Пожалуйста выберите другую дату отправки.

source: Link must belong to one of your domains: %(domains)s.
ru: Ссылка должна быть на одном из ваших доменов: %(domains)s.

source: Erroneous HTTP %(response_code)d response from url.
ru: Ошибочный код ответа сервера: %(response_code)d.

source: Got error while trying to access url: %(error_txt)s.
ru: Ошибка при попытке проверить работоспособность ссылки: %(error_txt)s.

source: endpoint
ru: идентификатор

source: key
ru: публичный ключ

source: is active
ru: активна

source: send errors
ru: ошибок отправки

source: useragent
ru: браузер

source: timezone
ru: часовой пояс

source: created
ru: создана

source: activated
ru: активирована

source: deactivated
ru: деактивирована

source: push subscription
ru: push-подписка

source: push subscriptions
ru: push-подписки

source: subscription ID %(pk)d
ru: подписка ID %(pk)d

source: title
ru: заголовок

source: message
ru: соощение

source: url
ru: ссылка

source: If there is no from param in url, ?from=push will be added automatically.
ru: Если в ссылке не указан источник, ?from=push добавится автоматически.

source: active
ru: включено

source: Is it an active task that should be done, or a draft.
ru: Надо ли выполнять или это пока черновик задания.

source: views
ru: показы

source: clicks
ru: клики

source: closings
ru: закрытия

source: When user closes the notification.
ru: Отказы, когда пользователь закрывает уведомление.

source: run at
ru: когда рассылать

source: Send time here is set according to subscriber's timezone! Also you can postpone sending.
ru: Время рассылки выставляется здесь в соответствии с часовым поясом подписчика! Также можно отложить рассылку на будущее.

source: started at
ru: начато

source: When we started to send this task.
ru: Когда начато проведение этой рассылки.

source: done at
ru: сделано

source: When work on this task has been done.
ru: Когда закончено проведение рассылки.

source: push task
ru: задание рассылки

source: push tasks
ru: задания рассылки

source: done
ru: сделано

source: %(num_closings)d times users rejected this notification
ru: %(num_closings)d закрытий уведомления пользователями

source: rejections
ru: отказы

source: run for
ru: рассылалось

source: %(timezone)s tz sub-task for %(task)s
ru: %(timezone)s подзадание для %(task)s

source: <strong>This page</strong> totals: %(views)s notification views and %(clicks)s clicks with the average CTR %(ctr)s. Rejections are %(closings_percent)s or %(closings)s times.
ru: Всего на <strong>этой странице</strong> %(views)s показов и %(clicks)s кликов при среднем CTR %(ctr)s. Отказы составили %(closings_percent)s или %(closings)s раз.

source: Turn push notifications on
ru: Включить уведомления от этого сайта

source: Turn push notifications off
ru: Отключить уведомления от этого сайта

source: How to unsubscribe from push-notifications
ru: Как отписаться от push-уведомлений

source: Select a browser in which you receive notifications from the site, and follow the instructions below.
ru: Выберите браузер (программу для просмотра интернета), в котором вам приходят уведомления от сайта, и действуйте по инструкции ниже.

source: <b>1.</b> Click the green (or grey) lock next to the &laquo;https://&raquo; in the address bar of the browser.
ru: <b>1.</b> Кликните на зеленый (или серый) замок рядом с надписью &laquo;https://&raquo; в адресной строке браузера.

source: <b>2.</b> Select &laquo;Block&raquo; for &laquo;Notifications&raquo;.
ru: <b>2.</b> Выберите &laquo;Блокировать&raquo; для пункта &laquo;Уведомления&raquo;.

source: <b>2.</b> Under &laquo;Permissions&raquo; click on (X) near &laquo;Send Notifications Allowed&raquo;.
ru: <b>2.</b> В разделе &laquo;Разрешения&raquo; нажмите на (X) напротив пункта &laquo;Отправлять уведомления Разрешено&raquo;.

source: Chrome for Android
ru: Chrome для Android

source: <b>1.</b> Tap the green (or grey) lock next to the &laquo;https://&raquo; in the address bar of the browser.
ru: <b>1.</b> Нажмите на зеленый (или серый) замок рядом с надписью &laquo;https://&raquo; в адресной строке браузера.

source: <b>2.</b> Tap &laquo;Site settings&raquo;:
ru: <b>2.</b> Нажмите &laquo;Настройки сайта&raquo;:

source: <b>3.</b> Tap &laquo;Notifications&raquo; and select &laquo;Block&raquo;:
ru: <b>3.</b> Нажмите &laquo;Уведомления&raquo; и выберите &laquo;Блокировать&raquo;:

source: Web-push from this site in your browser
ru: Настройка уведомлений в браузере

source: Here you can turn on or off push-notifications from this web-site in your browser.
ru: На этой странице вы можете включить или выключить уведомления от нашего сайта в своем браузере.

source: Important note: if you are on this page <b>to unsubscribe</b> from notifications from the site, then to click on the button below you need <b>the same browser</b>, in which you receive notifications.
ru: Важно: если вы зашли на эту страницу, <b>чтобы отписаться</b> от уведомлений с сайта, то открывать эту страницу и нажимать на кнопку ниже нужно <b>обязательно в том же браузере</b> (программе для просмотра интернета), в котором вам приходят уведомления.

source: Error occurred
ru: Произошла ошибка

source: We were unable to get information for this push message
ru: Не удалось получить уведомление с сайта
