Repository: pypi-data/pypi-mirror-89
Catalog: packages/django-privacy-mgmt/django-privacy-mgmt-0.0.21.tar.gz/django-privacy-mgmt-0.0.21/django_privacy_mgmt/locale/*/LC_MESSAGES/django.po
Languages: de, fr

source: Description
de: Beschreibung

source: What's the cookie's purpose?
de: Wozu dient der Cookie?

source: Lifetime
de: Lebenszeit

source: The cookie's liftime (e.g. 1 Year)
de: Die Lebenszeit des Cookies (z.B. 1 Jahr)

source: Domain of the cookie (e.g. .domain.com)
de: Domain des Cookies (z.B. .domain.com)

source: Ordering
de: Reihenfolge
fr: Commande

source: <a href="#" class="btn btn-default btn-xs js-cookie-accept pull-right">Accept</a> This website uses cookies to help ensure that you enjoy the best experience.<br/> If you do not consent to our use of cookies, please adjust your <a href="#" class="js-cookie-settings">privacy settings</a> accordingly.
de: <a href="#" class="btn btn-default btn-xs js-cookie-accept pull-right">Akzeptieren</a> Diese Website verwendet Cookies, um sicherzustellen, dass Sie das beste Erlebnis geniessen können.<br/> Wenn Sie mit der Verwendung von Cookies nicht einverstanden sind, passen Sie bitte Ihre <a href="#" class="js-cookie-settings">Datenschutzeinstellungen</a> entsprechend an.
fr: <a href="#" class="btn btn-default btn-xs js-cookie-accept pull-right">Accepter</a> Ce site Web utilise des cookies pour offrir une meilleure expérience de navigation aux utilisateurs.<br/> Si vous ne souhaitez pas que les cookies soient activés, adapte S.V.P. les <a href="#" class="js-cookie-settings">réglages de protection des données</a>.

source: Privacy Settings
de: Privatsphäre-Einstellungen
fr: Gestion de la sphère privée

source: Websites do not have full control over cookies that may set by various third-party scripts. To see detailed information about and to manage cookies in your browser, please check its privacy settings.
de: Websites haben nicht die volle Kontrolle über Cookies, die von verschiedenen Skripten Dritter gesetzt werden können. Um detaillierte Informationen über die Verwaltung von Cookies in Ihrem Browser zu erhalten, überprüfen Sie bitte die Datenschutzeinstellungen.
fr: Les sites Web ne disposent pas d’un contrôle total sur les cookies pouvant être installés par différents scripts de tiers. Pour obtenir des informations détaillées sur l’administration des cookies dans votre navigateur, vérifiez S.V.P. vos réglages de protection des données.

source: Essentials
de: Wesentliche
fr: Important

source: These cookies and scripts cannot be deactivated as they are needed to correctly render this website.
de: Diese Cookies und Skripte können nicht deaktiviert werden, da sie für die korrekte Darstellung dieser Website benötigt werden.
fr: Ces cookies et scripts ne peuvent pas être désactivés, car ils servent à l’affichage correct de ce site Web.

source: Currently none in use.
de: Derzeit nicht in Verwendung.
fr: Actuellement aucun en usage.

source: Statistics
de: Statistik
fr: Statistiques

source: These tools are used to collect statistics about user behaviour that helps us to improve our website and services. No personal data are collected.
de: Diese Tools werden verwendet, um Statistiken über das Nutzerverhalten zu sammeln, die uns helfen, unsere Website und unsere Dienstleistungen zu verbessern. Es werden keine personenbezogenen Daten erhoben.
fr: Ces outils sont utilisés pour collecter des statistiques sur les habitudes des utilisateurs, ce qui nous aide à améliorer notre site Web et nos prestations. Aucune donnée personnelle n’est collectée.

source: Personalisation
de: Personalisierung
fr: Personnalisation

source: In order to improve your experience of our services, we will customise your experience based upon your usage.
de: Um Ihre Erfahrung mit unseren Services zu verbessern, passen wir Ihre Erfahrung basierend auf Ihrer Nutzung an.
fr: Pour améliorer votre expérience de navigation avec nos services, nous adaptons celle-ci en nous basant sur vos habitudes d’utilisation.

source: Accept
de: Akzeptieren
fr: Accepter

source: Name
fr: Le nom
